In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("D:\Data Analyis\Python practice\Projects\Project-5\Housing+Data.csv")

In [4]:
data

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,9/1/2019,england,249942,E92000001,64605.0,NaN
13545,10/1/2019,england,249376,E92000001,68677.0,NaN
13546,11/1/2019,england,248515,E92000001,67814.0,NaN
13547,12/1/2019,england,250410,E92000001,NaN,NaN
13548,1/1/2020,england,247355,E92000001,NaN,NaN

In [5]:
data.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

In [9]:
#convert the data type columen "Date" to "date time" format
data['date'] = pd.to_datetime(data['date'])

In [10]:
data

,date,area,average_price,code,houses_sold,no_of_crimes,Ddate
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995-01-01
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995-02-01
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1995-03-01
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1995-04-01
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1995-05-01
...,...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,NaN,2019-09-01
13545,2019-10-01,england,249376,E92000001,68677.0,NaN,2019-10-01
13546,2019-11-01,england,248515,E92000001,67814.0,NaN,2019-11-01
13547,2019-12-01,england,250410,E92000001,NaN,NaN,2019-12-01
13548,2020-01-01,england,247355,E92000001,NaN,NaN,2020-01-01